In [1]:
from datetime import date
print(date.today())

2024-06-23

In [2]:
# select multiple columns in pandas

In [4]:
import pandas as pd

In [48]:
d1={
    'name':['a','b','c','d'],
    'age':[12,53,34,42],
    'gender':['m','f','m','f'],
    'state':['ap','up','mp','uk']
}
df=pd.DataFrame(d1)
print(df)

  name  age gender state
0    a   12      m    ap
1    b   53      f    up
2    c   34      m    mp
3    d   42      f    uk

In [16]:
print(df[['name','gender']])

  name gender
0    a      m
1    b      f
2    c      m
3    d      f

In [20]:
# selecting coloumns in range
print(df[df.columns[1:3]])

   age  roll
0   12    10
1   23    11
2   34    12
3   42    13

In [19]:
# insert column --add column at particular position
# assign column --add column as end
# insert(position,col name, col)

df.insert(2,"roll",[10,11,12,13])
print(df)

  name  age  roll gender state
0    a   12    10      m    ap
1    b   23    11      f    up
2    c   34    12      m    mp
3    d   42    13      f    uk

In [25]:
df.assign(rating=[1,2,3,4])

  name  age  roll gender state  rating
0    a   12    10      m    ap       1
1    b   23    11      f    up       2
2    c   34    12      m    mp       3
3    d   42    13      f    uk       4

In [27]:
print(df.assign(rating=[1,2,3,4]))

  name  age  roll gender state  rating
0    a   12    10      m    ap       1
1    b   23    11      f    up       2
2    c   34    12      m    mp       3
3    d   42    13      f    uk       4

In [31]:
# Delete ROws and Columns using Drop
df.drop('state',axis='columns')

  name  age  roll gender
0    a   12    10      m
1    b   23    11      f
2    c   34    12      m
3    d   42    13      f

In [35]:
df.drop('age',axis=1)
# to drop columns mention the column name and axis=1

  name  roll gender state
0    a    10      m    ap
1    b    11      f    up
2    c    12      m    mp
3    d    13      f    uk

In [36]:
df.drop(2,axis=0)
# to drop the rows mention the index and the axis=0

  name  age  roll gender state
0    a   12    10      m    ap
1    b   23    11      f    up
3    d   42    13      f    uk

In [38]:
# Iterate ROWS and COLUMNS
# --iterrows
# --itertuples

In [39]:
print(df)

  name  age  roll gender state
0    a   12    10      m    ap
1    b   23    11      f    up
2    c   34    12      m    mp
3    d   42    13      f    uk

In [40]:
for row in df.iterrows():
    print(row)

(0, name       a
age       12
roll      10
gender     m
state     ap
Name: 0, dtype: object)
(1, name       b
age       23
roll      11
gender     f
state     up
Name: 1, dtype: object)
(2, name       c
age       34
roll      12
gender     m
state     mp
Name: 2, dtype: object)
(3, name       d
age       42
roll      13
gender     f
state     uk
Name: 3, dtype: object)

In [41]:
for tuple in df.itertuples():
    print(tuple)

Pandas(Index=0, name='a', age=12, roll=10, gender='m', state='ap')
Pandas(Index=1, name='b', age=23, roll=11, gender='f', state='up')
Pandas(Index=2, name='c', age=34, roll=12, gender='m', state='mp')
Pandas(Index=3, name='d', age=42, roll=13, gender='f', state='uk')

In [43]:
# Iteration over columns using items()
for col in df.items():
    print(col)

('name', 0    a
1    b
2    c
3    d
Name: name, dtype: object)
('age', 0    12
1    23
2    34
3    42
Name: age, dtype: int64)
('roll', 0    10
1    11
2    12
3    13
Name: roll, dtype: int64)
('gender', 0    m
1    f
2    m
3    f
Name: gender, dtype: object)
('state', 0    ap
1    up
2    mp
3    uk
Name: state, dtype: object)

In [44]:
for a,b in df.items():
    print(a)
    print(b)

name
0    a
1    b
2    c
3    d
Name: name, dtype: object
age
0    12
1    23
2    34
3    42
Name: age, dtype: int64
roll
0    10
1    11
2    12
3    13
Name: roll, dtype: int64
gender
0    m
1    f
2    m
3    f
Name: gender, dtype: object
state
0    ap
1    up
2    mp
3    uk
Name: state, dtype: object

In [49]:
# Sorting in Pandas
print(df)
print(df.sort_values(by='age'))

  name  age gender state
0    a   12      m    ap
1    b   53      f    up
2    c   34      m    mp
3    d   42      f    uk
  name  age gender state
0    a   12      m    ap
2    c   34      m    mp
3    d   42      f    uk
1    b   53      f    up

In [58]:
print(df.sort_values(by='age' , ascending=False))

  name  age gender state
1    b   53      f    up
3    d   42      f    uk
2    c   34      m    mp
0    a   12      m    ap

In [59]:
data={
    'name':['a','b','c','d','e'],
    'marks':[88,94,34,99,88]
}
dframe=pd.DataFrame(data)
print(dframe)

  name  marks
0    a     88
1    b     94
2    c     34
3    d     99
4    e     88

In [61]:
print(dframe['marks'].duplicated())

0    False
1    False
2    False
3    False
4     True
Name: marks, dtype: bool

In [63]:
print(dframe.duplicated())

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [68]:
dframe['marks'].drop_duplicates()

0    88
1    94
2    34
3    99
Name: marks, dtype: int64

### Data Cleaning

In [71]:
dc=pd.read_csv("C:\\Users\\DELL\\OneDrive\\Desktop\\Clean.csv")
print(pd.read_csv("C:\\Users\\DELL\\OneDrive\\Desktop\\Clean.csv"))

  name  marks
0    a   75.0
1    b   46.0
2    c   97.0
3    d   57.0
4    e   72.0
5    f    NaN
6    g   62.0
7    h    NaN
8    i   86.0
9    j    NaN

In [70]:
# isnull() --replaces null values with True
# notnull() --replaces not null values with True
# dropna() --drops the rows with null values
# fillna(value) --fills the null values with specific value

In [72]:
print(dc.isnull())

    name  marks
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False
5  False   True
6  False  False
7  False   True
8  False  False
9  False   True

In [73]:
print(dc['marks'].isnull())

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
8    False
9     True
Name: marks, dtype: bool

In [75]:
print(dc['marks'].notnull())

0     True
1     True
2     True
3     True
4     True
5    False
6     True
7    False
8     True
9    False
Name: marks, dtype: bool

In [76]:
print(dc['marks'].dropna())

0    75.0
1    46.0
2    97.0
3    57.0
4    72.0
6    62.0
8    86.0
Name: marks, dtype: float64

In [77]:
print(dc['marks'].fillna(0))

0    75.0
1    46.0
2    97.0
3    57.0
4    72.0
5     0.0
6    62.0
7     0.0
8    86.0
9     0.0
Name: marks, dtype: float64

In [78]:
print(dc['marks'].fillna('AB'))

0    75.0
1    46.0
2    97.0
3    57.0
4    72.0
5      AB
6    62.0
7      AB
8    86.0
9      AB
Name: marks, dtype: object

In [79]:
# OPERATIONS ON STRING
series=['Alice','Alex','BoB','cat','Doll']
sp=pd.Series(series)
print(sp)

0    Alice
1     Alex
2      BoB
3      cat
4     Doll
dtype: object

In [80]:
print(sp.str.lower())

0    alice
1     alex
2      bob
3      cat
4     doll
dtype: object

In [81]:
print(sp.str.upper())

0    ALICE
1     ALEX
2      BOB
3      CAT
4     DOLL
dtype: object

In [82]:
print(sp.str.title())

0    Alice
1     Alex
2      Bob
3      Cat
4     Doll
dtype: object

In [84]:
print(sp.str.len())
# Gives the length of the String

0    5
1    4
2    3
3    3
4    4
dtype: int64

In [86]:
# count() --counts the non null values 
print(sp.count())

5

In [92]:
# contains() --to search for a value
print(sp.str.contains('Alex'))
# contains() is case sensitive
print("\n",sp.str.contains('alex'))

0    False
1     True
2    False
3    False
4    False
dtype: bool

 0    False
1    False
2    False
3    False
4    False
dtype: bool

### Date and Time in Pandas

In [93]:
print(pd.Timestamp.now())

2024-06-23 23:37:49.430560

In [100]:
timestamp=pd.Timestamp.now()
print(timestamp.dayofweek)

6

In [101]:
print(timestamp.dayofyear)

175

In [103]:
print(timestamp.daysinmonth)

30

In [107]:
print(timestamp.is_leap_year)

True

In [108]:
print(timestamp.is_month_end)

False

In [109]:
print(timestamp.is_month_start)

False

In [110]:
print(timestamp.is_year_end)

False

In [112]:
print(timestamp.is_year_start)

False

In [113]:
'''Remove whiteSpace or character in series or DataFrame'''

'Remove whiteSpace or character in series or DataFrame'

In [115]:
# using --strip() --lstrip() --rstrip()
series=["\t Alice \t",'Alex\t','\tBoB','\t\tcat','Doll\t\t']
sp=pd.Series(series)
print(sp)

0    \t Alice \t
1         Alex\t
2          \tBoB
3        \t\tcat
4       Doll\t\t
dtype: object

In [116]:
print(sp.str.strip())

0    Alice
1     Alex
2      BoB
3      cat
4     Doll
dtype: object

In [117]:
print(sp.str.lstrip())

0    Alice \t
1      Alex\t
2         BoB
3         cat
4    Doll\t\t
dtype: object

In [118]:
print(sp.str.rstrip())

0    \t Alice
1        Alex
2       \tBoB
3     \t\tcat
4        Doll
dtype: object

In [119]:
# Grouping the data
d1={
    'name':['a','b','c','d'],
    'age':[12,53,34,42],
    'roll':[1,2,3,4],
    'state':['ap','up','mp','uk']
}
df=pd.DataFrame(d1)
print(df)

  name  age  roll state
0    a   12     1    ap
1    b   53     2    up
2    c   34     3    mp
3    d   42     4    uk